app/views/tasks/index.html.erb


<% if @event.tasks.count > 0 %>
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 17]]