app/views/tasks/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 5]]
---
          <small>
            <%= pluralize(@task.user.tasks.count, "task") if @task.user.tasks %>

UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", "t"], ["updated_at", "2017-09-07 23:05:02.244383"], ["id", 10]]
---
    <small>
      Created by: <%= @task.user.username if @task.user%>,
      <%= time_ago_in_words(@task.created_at) %> ago,
      last updated: <%= time_ago_in_words(@task.updated_at) %> ago