app/views/users/index.html.erb

          <small>
            <%= pluralize(user.events.count, "event") if user.events %>
---
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]