app/views/users/show.html.erb


<% if @user.events.count > 0 %>
---
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]