app/views/events/_event.html.erb

        <small class="tasks_count">
          (<%= link_to pluralize(event.tasks.count, 'task'), event_tasks_path(event)%>)
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 1]]