app/views/events/show.html.erb

          <small>
            <%= pluralize(@event.user.events.count, "event") if @event.user.events %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]