app/controllers/events_controller.rb

  def index
    @events = Event.paginate(page: params[:page], per_page: 5)
---
SELECT  "events".* FROM "events" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"

  def create
    @event = Event.new(event_params)
    @event.user = current_user
    if @event.save
---
INSERT INTO "events" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Event 1"], ["description", "This is event description"], ["created_at", "2017-09-05 20:13:13.651354"], ["updated_at", "2017-09-05 20:13:13.651354"], ["user_id", 1]]