app/controllers/tasks_controller.rb

  def index
    @tasks = @event.tasks.paginate(page: params[:page], per_page: 5)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ? LIMIT ? OFFSET ?  [["event_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 1]]

  def create
    @task = Task.new(task_params)
    @task.event = @event
    @task.user = current_user
    if @task.save
---
INSERT INTO "tasks" ("title", "description", "deadline", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Description for Event task edited"], ["updated_at", "2017-09-07 00:33:05.053206"], ["id", 4]]

  def completed_toggle
    @task.completed = true
    if @task.save
---
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", "t"], ["updated_at", "2017-09-07 23:03:36.500289"], ["id", 9]]

    def set_task
      @task = Event.find(params[:event_id]).tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ? AND "tasks"."id" = ? LIMIT ?  [["event_id", 18], ["id", 9], ["LIMIT", 1]]