app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "souvik"], ["password_digest", "$2a$10$nslqcICMl93PGS5YhYe1euYPu/tk46jFV./Noo4Ws.q0XI7OP.9ci"], ["updated_at", "2017-09-04 20:41:45.629498"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
SELECT  "events".* FROM "events" WHERE "events"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 1]]
---
  def show
    if logged_in? && current_user == @user
      @user.tasks.each do |task|
        if task.deadline < Time.now and !task.completed
          if flash.now[:danger]
            flash.now[:danger] += "<br><br><b>#{task.title}</b> is due on #{task.deadline}"
          else
            flash.now[:danger] = "<b>#{task.title}</b> is due on #{task.deadline}"
          end
        end
      end
    end
    @user_events = @user.events.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user = User.find(params[:id])
    if @user == current_user
      restore_session
    end
    @user.destroy